[{"content":"QMC-HAMM High accuracy multiscale models from quantum Monte Carlo\nThe QMC-HAMM project is based on quantum Monte Carlo (QMC) techniques to accurately compute the properties of materials very accurately. Multiscale models are then derived based on these accurate calculations.\n","date":-62135596800,"description":"","objectID":"3976528693a0108357f4928017600865","permalink":"https://qmc-hamm.github.io/","title":"Home"},{"content":"Mission A major theme of condensed matter and materials physics is the relationship between the microscopic behavior of electrons and nuclei to the emergent low-energy mesoscopic behavior of materials. Elucidating this relationship is a challenge, since the microscopic model requires advanced solution methods for many-body quantum mechanics, and the mesoscopic picture can be rather complicated. In complex materials, standard concepts at the mesoscopic level such as phonons, spins, and electron-like excitations can interact in complex ways which are difficult to access experimentally.\nThe state of the art in creating mesoscopic models starting from microscopic behavior is based on density functional theory (DFT) calculations. In recent years, modern machine learning techniques have been able to reproduce potential energy surfaces from standard DFT functionals to a very high accuracy; the accuracy potential energy surfaces can be limited by the underlying data. In quantum materials such as twisted bilayer graphene,(pictured above) interactions between electronic excitations can be critical to their behavior. To resolve the above issues, it is necessary to move beyond density functional theory and to base mesoscopic models on more accurate microscopic calculations. In this project, we will use quantum Monte Carlo calculations as a base for high-impact projects which can benefit from extra accuracy.\nVision At each length scale of interest, advanced tools exist. Our collaboration contains experts at each of these length scales. Our goal is to systematically link the microscopic to the mesoscopic by using well-defined data interfaces. The highly accurate, sub-atomic scale quantum Monte Carlo calculations produce data, which is then used to understand the physics at the atomic scale, and so on. Reproducibility and documentation are achieved by using modern scientific computing methods.\nAcknowledgments This project is supported by the U.S. Department of Energy, Office of …","date":-62135596800,"description":"","objectID":"6083a88ee3411b0d17ce02d738f69d47","permalink":"https://qmc-hamm.github.io/about/","title":"About"},{"content":"Data products from our collaboration.\nTight-binding data for bilayer graphene QMC data for bilayer graphene van der Waals interactions Hydrogen forces and energy from QMC ","date":-62135596800,"description":"","objectID":"77c2d2ba0979ac9954ceb502de85c1ce","permalink":"https://qmc-hamm.github.io/data/","title":"Data"},{"content":"Current Lucas Wagner Director Multiscale quantum models David Ceperley co-PI Quantum Monte Carlo, High pressure hydrogen Harley Johnson co-PI Tight binding Elif Ertekin co-PI Uncertainty quantification Ben Galewsky Software and data engineer Ben is helping with workflows and data publication. Scott Jensen Postdoctoral Associate Hydrogen and 2D electron gas. Tawfiqur Rakib Postdoctoral Associate Tawfiq is working on uncertainty quantification. Kittithat (Mick) Krongchon Graduate Student Mick is working on van der Waals interactions in 2D systems. Daniel (Dan) Palmer Graduate Student Dan is working on total energy tight binding models. Doruk Uçar Graduate Student Doruk is working on uncertainty quantification. Kevin Ly Graduate Student Kevin is working on learning hydrogen models. Shubhang Goswani Graduate Student Shubhang is working on learning hydrogen models. Sonali Joshi Graduate Student Sonalis is work on automated learning of quantum models from ab initio calculations. Alumni Andriy Nevidomskyy co-PI Correlated lattice models Matthew Turk co-PI yt, visualization Yueqing Chang Graduate Student Learning emergent models from ab initio calculations. She graduated in 2022 and moved on to a postdoc at Rutgers. Shivesh Pathak Graduate Student Learning emergent models from ab initio calculations. He graduated in 2021 and moved on to a postdoc at Sandia National Labs. ","date":-62135596800,"description":"","objectID":"9f38ed31aac9de05dfdac36913888ab0","permalink":"https://qmc-hamm.github.io/group/","title":"Group members"},{"content":" Training models using forces computed by stochastic electronic structure methods David M. Ceperley, Scott Jensen, Yubo Yang, Hongwei Niu, Carlo Pierleoni, Markus Holzmann Electronic Structure 6 015011 (2024)\nField induced non-BEC transitions in frustrated magnets Shouvik Sur, Yi Xu, Shuyi Li, Shou-Shu Gong, Andriy H. Nevidomskyy Physical Review Letters 132 066701 (2024)\nDipolar Weyl semimetals Alexander C. Tyner, Shouvik Sur Physical Review B 109 L081101 (2024)\nRegistry-dependent potential energy and lattice corrugation of twisted bilayer graphene from quantum Monte Carlo Kittithat Krongchon, Tawfiqur Rakib, Shivesh Pathak, Elif Ertekin, Harley T. Johnson, Lucas K. Wagner Physical Review B 108 235403 (2023)\nDownfolding from Ab Initio to Interacting Model Hamiltonians: Comprehensive Analysis and Benchmarking Yueqing Chang, Erik G. C. P. van Loon, Brandon Eskridge, Brian Busemeyer, Miguel A. Morales, Cyrus E. Dreyer, Andrew J. Millis, Shiwei Zhang, Tim O. Wehling, Lucas K. Wagner, Malte Rösner (2023)\nStatic Self-Energy and Effective Mass of the Homogeneous Electron Gas from Quantum Monte Carlo Calculations Markus Holzmann, Francesco Calcavecchia, David M. Ceperley, Valerio Olevano Physical Review Letters 131 186501 (2023)\nHelical dislocation in twisted bilayer graphene Tawfiqur Rakib, Pascal Pochet, Elif Ertekin, Harley T. Johnson Extreme Mechanics Letters 63 102053 (2023)\nPyQMC : An all-Python real-space quantum Monte Carlo module in PySCF William A. Wheeler, Shivesh Pathak, Kevin G. Kleiner, Shunyue Yuan, João N. B. Rodrigues, Cooper Lorsung, Kittithat Krongchon, Yueqing Chang, Yiqing Zhou, Brian Busemeyer, Kiel T. Williams, Alexander Muñoz, Chun Yu Chow, Lucas K. Wagner The Journal of Chemical Physics 158 114801 (2023)\nNeutral band gap of carbon by quantum Monte Carlo methods V. Gorelov, Y. Yang, M. Ruggeri, D. M. Ceperley, C. Pierleoni, M. Holzmann Condensed Matter Physics 26 33701 (2023)\nStable Solid Molecular Hydrogen above 900 K from a Machine-Learned …","date":-62135596800,"description":"","objectID":"82ba9eab22f9b360795eb8ad75fe156f","permalink":"https://qmc-hamm.github.io/papers/","title":"Papers"},{"content":"Software products from our collaboration\nTight-binding model for bilayer graphene ","date":-62135596800,"description":"","objectID":"f06a2a5c6da30d4cf59dafd2c9419459","permalink":"https://qmc-hamm.github.io/software/","title":"Software"}]